```
=========> Existing resources:
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.container_apps.azurerm_log_analytics_workspace.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
1.14.3
module.acr.module.public_ip.data.curl.big_data_cloud: Reading...
module.acr.module.public_ip.data.curl.big_data_cloud: Read complete after 0s [id=1767683093]
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry]
module.acr.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry]
module.acr.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry]
module.container_apps.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.OperationalInsights/workspaces/law-avm-telemetry]
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.OperationalInsights/workspaces/telemetry-proxy-log-analytics-workspace]
module.acr.azurerm_private_dns_zone.pdz: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.acr.azurerm_subnet.container_apps: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/containerapps]
module.acr.azurerm_subnet.acr: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/virtualNetworks/telemetry/subnets/acr]
module.container_apps.azurerm_application_insights.this: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Insights/components/ai-avm-telemetry]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.App/managedEnvironments/telemetry-proxy]
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/virtualNetworkLinks/mydnslink]
module.acr.data.azurerm_container_registry_scope_map.pull: Reading...
module.acr.data.azurerm_container_registry_scope_map.push: Reading...
module.acr.azurerm_private_endpoint.pep: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateEndpoints/mype]
module.acr.data.azurerm_container_registry_scope_map.push: Read complete after 0s [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/scopeMaps/_repositories_push]
module.acr.azurerm_container_registry_token.push: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token]
module.acr.data.azurerm_container_registry_scope_map.pull: Read complete after 0s [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/scopeMaps/_repositories_pull]
module.acr.azurerm_container_registry_token.pull: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token]
module.acr.azurerm_container_registry_token_password.pull_password: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/pull-token/passwords/password]
module.acr.azurerm_container_registry_token_password.push_password: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry/tokens/push-token/passwords/password]
module.acr.azurerm_private_dns_a_record.login_server: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry]
module.acr.azurerm_private_dns_a_record.data: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io/A/avmtelemetry.eastus.data]
module.docker_image.null_resource.go_code_keeper: Refreshing state... [id=3585567913266332712]
module.docker_image.docker_image.proxy: Refreshing state... [id=sha256:417b532dbc42379dfe3fe197420f13fd13604e4bf1a5ec0fc350a69939d8aad3avmtelemetry.azurecr.io/telemetry_proxy]
module.docker_image.docker_registry_image.proxy: Refreshing state... [id=sha256:157d753b868deb53c9655b128e5aea1a5b293065af32860e2e0524c03d2c2f4a]
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]: Refreshing state... [id=/subscriptions/0576f15f-eb64-41d3-99a2-e28f38ccd53c/resourceGroups/avm-telemetry/providers/Microsoft.App/containerApps/telemetry-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id          = "sha256:417b532dbc42379dfe3fe197420f13fd13604e4bf1a5ec0fc350a69939d8aad3avmtelemetry.azurecr.io/telemetry_proxy"
      - name        = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "d50ae297497a1714fc0afadcd02d32fa"
          + "dockerfile" = "54601d5c8a0d525d99fead166b20aa15"
        }

      + build {
          + cache_from     = []
          + context        = "docker_image"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
            # (13 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.proxy will be replaced due to changes in replace_triggered_by
-/+ resource "docker_registry_image" "proxy" {
      ~ id                   = "sha256:157d753b868deb53c9655b128e5aea1a5b293065af32860e2e0524c03d2c2f4a" -> (known after apply)
        name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      ~ sha256_digest        = "sha256:157d753b868deb53c9655b128e5aea1a5b293065af32860e2e0524c03d2c2f4a" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.docker_image.null_resource.go_code_keeper must be replaced
-/+ resource "null_resource" "go_code_keeper" {
      ~ id       = "3585567913266332712" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dockerfile" = "0a32825646f15354ae5360331a673c37" -> "54601d5c8a0d525d99fead166b20aa15"
          ~ "go_mod"     = "23f74f085d2661e78a3a2d2588c49321" -> "76824ca350a14504474a81670ab9216c"
          ~ "go_sum"     = "b8ea6d50c255dcec9d2fd07d2bf53b1d" -> "516cea1e7e8a1729b1027a1d43f67039"
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.acr.azurerm_subnet.acr,
  on acr/main.tf line 72, in resource "azurerm_subnet" "acr":
  72:   private_endpoint_network_policies_enabled     = false

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```